Revit 2027 API
SchemaBuilder.SetApplicationGUID Method
 Sets the GUID of the application or add-in that may access entities of this Schema under the Application acess level.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SchemaBuilder SetApplicationGUID(
	Guid applicationGUID
)
Public Function SetApplicationGUID (
	applicationGUID As Guid
) As SchemaBuilder
public:
SchemaBuilder^ SetApplicationGUID(
	Guid applicationGUID
)
member SetApplicationGUID :
        applicationGUID : Guid -> SchemaBuilder
Parameters
applicationGUID Guid
 The application id.
Return Value
SchemaBuilder
 The SchemaBuilder object may be used to add more settings.
Exceptions
Exception | Condition
InvalidOperationException |  The SchemaBuilder has already finished building the Schema.
See Also
Reference
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace